URL = "url"
NAME = "name"
TIME_TO_SLEEP = 86400
ZIP_FILES_DIRECTORY = "./zip_files"
XML_FILES_DIRECTORY = "./xml_files"
DATE_FORMAT = "%Y%m%d"
DOWNLOAD_LINKS_YENOT_BITAN_FULL = "//a[(contains(@href, 'Full'))]"
DOWNLOAD_LINKS_YENOT_BITAN_STORES = "(//a[(contains(@href, 'Stores'))])[1]"
DOWNLOAD_LINKS_VICTORY = "//tr[.//td[contains(text(), 'ויקטורי')] and .//a[contains(@href, 'Full')]]//a"
URL_FILES = './urls.json'

CATEGORIES = {
    "פירות וירקות": ["תפוח", "בננה", "תפוז", "עגבנייה", "מלפפון", "גזר", "אבטיח", "מלון", "שזיף", "ענבים", "חסה",
                     "פלפל", "קישוא", "כרוב", "תות", "מנגו", "קיווי", "אננס", "אשכולית", "לימון", "דובדבן", "אוכמניות",
                     "רימון", "תאנה", "פפאיה", "אנונה", "פומלה", "תמר", "אפרסק", "משמש", "אגס", "פיטאיה", "פירות יער",
                     "אוכמניות שחורות", "זיתים", "סלק", "בצל", "שום", "פטריות", "חציל", "דלעת", "תירס", "ברוקולי",
                     "כרובית", "ארטישוק", "אספרגוס", "כרישה", "קולורבי", "תרד", "פול", "שעועית", "עדשים", "במיה",
                     "רוזמרין", "פטרוזיליה", "שמיר", "בזיליקום", "נענע", "מליסה", "טימין", "כוסברה", "מרווה",
                     "תפוח אדמה", "בטטה", "קולורבי", "צנון", "צנונית", "שומר", "סלרי", "פאפיה", "קוקוס", "אפרסמון",
                     "גרגר נחלים", "גמבה", "רוקט"],
    "מוצרי חלב וביצים": ["חלב", "גבינה", "יוגורט", "שמנת", "חמאה", "קוטג'", "ביצים", "ריקוטה", "לאבנה", "לבנה",
                         "גבינת שמנת", "שמנת חמוצה", "חלב סויה", "חלב שקדים", "חלב עיזים", "מעדן חלב", "גבינת מוצרלה",
                         "גבינת צהובה", "חלב קוקוס", "גבינת פרמזן"],
    "בשר עוף ודגים": ["בשר", "עוף", "דג", "טונה", "כבש", "הודו", "סלמון", "סרדינים", "סטייק", "שניצל", "חזה עוף",
                      "כנפיים", "קבב", "נקניקיות", "בקר", "המבורגר", "אסאדו", "צלעות", "סרדין", "פילה דג", "כבד",
                      "קרפיון"],
    "לחמים ומוצרי מאפה": ["לחם", "פיתה", "לחמניה", "בגט", "בורקס", "עוגה", "עוגיות", "קרואסון", "מאפין", "מאפה",
                          "בייגלה", "לחם מחיטה מלאה", "לחם שיפון", "פוקצ'ה", "בצק עלים", "בראוניז", "לחם קל",
                          "לחמניות חלב", "חלה", "בצק פילאס", "דונאט", "בצק שמרים"],
    "משקאות יין אלכוהול וטבק": ["מים", "יין", "בירה", "ויסקי", "וודקה", "ליקר", "סיגריות", "טבק", "קולה", "משקה",
                                "מיץ", "משקה אנרגיה", "משקה קל", "שמפניה", "קוניאק", "סודה", "שיכר", "משקה דיאט",
                                "טוניק", "ערק", "קוקטייל"],
    "מזון מקורר קפוא ונקניקים": ["קפוא", "גלידה", "פיצה", "נקניק", "שניצל", "פלאפל", "בורגר", "מילקי", "קציצות",
                                 "רביולי", "המבורגר קפוא", "כופתאות", "בצק עלים קפוא", "בשר טחון קפוא", "סורבה",
                                 "נקניקיות קפואות", "קיש קפוא", "שניצל תירס", "פסטה קפואה", "בלינצ'ס",
                                 "ממולאים קפואים"],
    "בישול אפייה ושימורים": ["שמן", "קמח", "סוכר", "מלח", "רסק עגבניות", "טונה משומרת", "שעועית", "חומוס", "קמח תירס",
                             "אבקת אפייה", "קוקוס טחון", "מרק עוף", "רוטב סויה", "רוטב עגבניות", "גרגירי תירס", "חומץ",
                             "תמצית וניל", "רוטב שום", "שמרים יבשים", "קקאו", "ריבה", "מחית תמרים"],
    "חטיפים מתוקים ודגני בוקר": ["שוקולד", "חטיף", "עוגיות", "דגנים", "ממתקים", "ביסקוויט", "חטיף אנרגיה", "קורנפלקס",
                                 "עוגות", "חטיפי בריאות", "סוכריות", "ופלים", "חטיף צ'יפס", "גרנולה", "פופקורן",
                                 "טופי", "בייגלה מצופה שוקולד", "דגני בוקר", "פתי בר", "מיקס אגוזים", "חטיפי חלבון",
                                 "מסטיקים"],
    "פארם וטיפוח": ["שמפו", "סבון", "משחת שיניים", "דאודורנט", "תחבושות", "קרם לחות", "בושם", "מסכת פנים", "פדים",
                    "ויטמינים", "ג'ל רחצה", "קרם ידיים", "מגבון", "תחליב גוף", "קרם הגנה", "שפתון", "איפור",
                    "שמפו לשיער יבש", "משחת הגנה לשפתיים", "מסיר איפור", "מי פנים", "סבון אנטיבקטריאלי"],
    "עולם התינוקות": ["שמפו", "סבון", "משחת שיניים", "דאודורנט", "תחבושות", "קרם לחות", "בושם", "מסכת פנים", "פדים",
                      "ויטמינים", "ג'ל רחצה", "קרם ידיים", "מגבון", "תחליב גוף", "קרם הגנה", "שפתון", "איפור",
                      "שמפו לשיער יבש", "משחת הגנה לשפתיים", "מסיר איפור", "מי פנים", "סבון אנטיבקטריאלי"],

    "ניקיון וחד פעמי": ["סבון כלים", "נייר טואלט", "שקיות אשפה", "מטאטא", "מטליות", "כפפות חד פעמיות", "סמרטוט",
                        "חומר ניקוי", "סקוטשברייט", "מגבות נייר", "ספריי ניקוי", "מלבין", "חומר חיטוי", "שואב אבק",
                        "נייר אפייה", "נייר מגבת", "רב-פעמי", "אבקת כביסה", "מרכך כביסה", "נייר אלומיניום",
                        "שקיות ניילון"],
    "בעלי חיים": ["אוכל לכלבים", "אוכל לחתולים", "חול לחתול", "עצם לעיסה", "רצועה", "כלוב", "צעצוע לכלב", "שקית צרכים",
                  "מזון דגים", "חול חתולים", "פינוקים לכלבים", "פינוקים לחתולים", "חטיפים לכלבים", "רצועות לעיסה",
                  "אקווריום", "מיטה לחתול", "שמפו לחיות", "תוספי תזונה לחיות", "כלוב לציפורים", "שמפו לכלבים",
                  "אוכל לציפורים"],
    "ויטמינים ותוספי תזונה": ["ויטמין", "תוסף תזונה", "ברזל", "אבץ", "פרוביוטיקה", "מגנזיום", "אומגה 3", "ויטמין C",
                              "סידן", "ויטמין D", "ביוטין", "חומצה פולית", "ויטמין B12", "קומפלקס ויטמינים", "כמוסות",
                              "אבקת חלבון", "תוסף מגנזיום", "מולטיוויטמין", "תוסף סיבים", "אומגה 6", "ויטמין"],
    "אורגני ובריאות": ["אורגני", "בריאות", "ללא גלוטן", "ללא סוכר", "מזון בריאות", "סויה", "כוסמת", "אגוזים",
                       "שיבולת שועל", "גרעינים", "מזון טבעוני", "מיץ טבעי", "לחם כוסמין", "קינואה", "מזון אורגני",
                       "שמן זית", "טחינה", "סלט"]
}
